{
    "text_chunks":[
        {"subject_matter": "public_customer_stories","related_content_id":"e4327a69-b5d6-4ce3-8e45-b4cae0095282","content_summary_for_prompt_similarity": "Shipt is a company that switched databases from postgres to cockroach","text_chunk": "Shipt, a logistics and delivery company acquired by Target, struggled with their prior postgres database in keeping delivery drivers connected and wanted to avoid unnecessary dependencies and cost to their business that came from using the Twilio platform in their driver sms-based application.  They selected CockroachDB to act as their database for a home-grown replacement for Twilio and found success in both delivering reliable throughput and latency across all the users while also ensuring all data was always consistent.  The biggest immmediate benefit Shipt received from using CockroachDB was the removal of the need to do manual corrections and reconciliations to the data in their system (something they had to do far too often when their previous database failed to synchronize data across regions and even lost data during outages.  Shipt enjoys the zero Recovery Time Objective or (Zero RPO) facilitated by CockroachDB and the cross region deployment it supports.  Shipt also services thousands of stores across North America and benefits from the ability to store data as close to each store as possible, thus reducing latency for updates and reads to and from delivery and inventory tables.  Shipt also values the compatibiility of CRDB with Postgresql: both the ability to use Postgres drivers, and the support of postgres syntax.  Shipt has many engineers with extensive experience using Postgres and they found the transition to CRDB to be simple."},
        {"subject_matter": "public_customer_stories","related_content_id":"9f7a30e2-efd3-4d51-8584-ce12f1af0b7f","content_summary_for_prompt_similarity": "Hard Rock Digital is a company that switched databases from postgres to cockroach","text_chunk": "Hard Rock Digital, the global interactive gaming and sports betting arm of Hard Rock, chose CockroachDB to power its highly regulated online sports betting platform. They needed and required a database that could handle: rapid scale, deliver always-on availability, and meet stringent regulatory requirements for data consistency and disaster recovery. CockroachDB enabled Hard Rock Digital to confidently expand into multiple US states, ensuring compliance with the storage and resilience mandates of each region, while delivering seamless player experiences even during periods of peak betting demand. With CockroachDB, Hard Rock Digital was able to innovate quickly in the competitive gaming sector, all while maintaining maximum uptime and regulatory assurance.  Traditional databases like PostgreSQL (which they used previously for other parts of their stack) lacked effective solutions for scaling beyond a single machine, high-availability, and cross-region operations. Scaling user concurrency, transactional load, and state-specific workloads, all while maintaining compliance, was not feasible with their previous architecture."},
        {"subject_matter": "public_information","related_content_id":"c25038ae-69de-4b0a-9397-fe1d7b8b4529","content_summary_for_prompt_similarity": "Spencer Kimball is a man","text_chunk": "Spencer Kimball is the CEO of Cockroach Labs, where he leads the development of scalable and resilient database solutions. Prior to this, he was an engineer at Square, contributing to their payment platform, and served as CTO at Viewfinder, overseeing social photo-sharing applications. He also spent nearly a decade at Google as a Staff Software Engineer, working on projects like the Google Servlet Engine and Colossus, Google’s distributed file storage system. Earlier in his career, Spencer co-founded WeGo Systems, where he led technology development. He was one of the two original creators of GIMP (GNU Image Manipulation Program). He and Peter Mattis, began developing GIMP in 1995. He holds a Bachelor’s degree in Computer Science from the University of California, Berkeley."},
        {"subject_matter": "public_information","related_content_id":"579547d5-4dc8-469a-9bb3-51cd187d4e31","content_summary_for_prompt_similarity": "Gorilla, Tiger, Lion, Elephant, Giraffe and other animals in the zoo database have names, species, ages and locales","text_chunk": "The Sample query to emulate when selecting all data is SELECT NAME, AGE, SPECIES, LOCALE FROM zoo.ANIMALS LIMIT 1; Animals in the zoo have names, species, ages and locales.  I want to know the name or age or species or locale of the animal.  I might know one of these attributes."},
        {"subject_matter": "public_information","related_content_id":"20f1f2f9-5475-44b5-b10a-f0d4ec7783c7","content_summary_for_prompt_similarity": "Details regarding a special brand of plums bred in Florida by Plum Bob Fruit Company","text_chunk": "The Plum Bob Fruit Company has successfully bred a plum called the 'Balloon Plum' that individually can weighs up to 1 lb.  They are bright blue in color and grow on large trees with white bark and deep root systems.  They are sweet and fibrous and a single plum provides 50% of the daily  vitamin C dose for an adult person.  They are available in HEB stores for $12.00 each from July through September each year."}
    ]
}